Tekla.Structures.TeklaStructuresSettings
The TeklaStructuresSettings class provides methods to inquire application settings.

Tekla.Structures.TeklaStructuresSettings.GetAdvancedOption(System.String,System.Boolean@)
Returns the value of an advanced option variable.
VariableName: The name of the advanced option.
Value: The returned value of the advanced option.
Returns: True if the value was successfully retrieved.

Tekla.Structures.TeklaStructuresSettings.GetAdvancedOption(System.String,System.Int32@)
Returns the value of an advanced option variable.
VariableName: The name of the advanced option.
Value: The returned value of the advanced option.
Returns: True if the value was successfully retrieved.

Tekla.Structures.TeklaStructuresSettings.GetAdvancedOption(System.String,System.String@)
Returns the value of an advanced option variable.
VariableName: The name of the advanced option.
Value: The returned value of the advanced option.
Returns: True if the value was successfully retrieved.

Tekla.Structures.TeklaStructuresSettings.GetAdvancedOption(System.String,System.Double@)
Returns the value of an advanced option variable.
VariableName: The name of the advanced option.
Value: The returned value of the advanced option.
Returns: True if the value was successfully retrieved.

Tekla.Structures.TeklaStructuresSettings.GetAdvancedOptionPaths(System.String,System.Collections.Generic.List{System.String}@,Tekla.Structures.TeklaStructuresSettings.InvalidPathCallback)
Gets the value of an advanced option as a list of valid paths.
Strings with path separator ; are split into separate paths and any blank paths (containing only white space) are ignored.
Paths do not need to exist but must use valid characters and format.
Note: All valid paths are returned even when invalid paths are encountered.
The following example gets the first existing instance of a specified file name from the firm,
project or system folders.
using System;
using System.Collections.Generic;
using System.IO;
using Tekla.Structures;
public class Example
{
An example GetAdvancedOptionPaths error callback which logs any advanced option path error.
advancedOpt: The advanced option being processed when the error occurred.
invalidString: The invalid string if identified.
exceptionMessage: The exception message if an exception was thrown when converting the string to a path.
public static void MyGetAdvancedOptionPathsErrorCallback(string advancedOpt, string invalidString, string exceptionMessage)
{
Console.WriteLine(
string.Format(
"The advanced option path string {0} could not be read correctly. Some or all of its content(s) will be ignored.",
advancedOption));
if (!string.IsNullOrWhiteSpace(invalidString))
{
Console.WriteLine("The invalid string is: " + invalidString);
}
if (!string.IsNullOrWhiteSpace(exceptionMessage))
{
Console.WriteLine("The exception message is: " + exceptionMessage);
}
}
Tries to get the first existing instance of a specified file name from the firm,
project or system folders.
fileName: Name of the file.
filePath: The file path of the first file found.
Returns: True if successful; otherwise false.
public static bool TryGetFileInFirmProjectOrSystemFolders(string fileName, out string filePath)
{
filePath = null;
var advancedOptions = new List<string> { "XS_FIRM", "XS_PROJECT", "XS_SYSTEM" };
foreach (var advancedOption in advancedOptions)
{
List<string> paths;
if (!TeklaStructuresSettings.GetAdvancedOptionPaths(
advancedOption,
out paths,
MyGetAdvancedOptionPathsErrorCallback))
{
continue;
}
foreach (var path in paths)
{
var fileToFind = Path.Combine(path, fileName);
if (File.Exists(fileToFind))
{
filePath = fileToFind;
return true;
}
}
}
return false;
}
}
advancedOption: The advanced option name.
paths: The paths.
errorHandler: The optional error handler callback.
Returns: True if the variable is read successfully and contains no invalid paths; otherwise false.

Tekla.Structures.TeklaStructuresSettings.GetOptions(Tekla.Structures.ClashCheckOptions@)
Returns the value of the clash check options.
Options: The returned value of the clash check options.
Returns: True if the values were successfully retrieved.

Tekla.Structures.TeklaStructuresSettings.SetOptions(Tekla.Structures.ClashCheckOptions)
Sets the clash check options.
Options: The clash check options to be set.
Returns:
True if the clash check options were successfully set.

Tekla.Structures.TeklaStructuresSettings.GetOptions(Tekla.Structures.ComponentOptions@)
Returns the value of the component options.
Options: The returned value of the component options.
Returns:
True if the values were successfully retrieved.

Tekla.Structures.TeklaStructuresSettings.SetOptions(Tekla.Structures.ComponentOptions)
Sets the component options.
Options: The component options to be set.
Returns:
True if the component options were successfully set.
Throws System.ArgumentNullException: Options cannot be null
Throws System.OverflowException: Folded Plate Profile Name is too long
or
Plate Profile Name is too long
or
Bolt Standard is too long
or
Bolt Size is too long
or
Part Material is too long
or
or
or
or

Tekla.Structures.TeklaStructuresSettings.IsToolOptionOn(System.String)
Determines whether select switch is on.
toolOptionName: Name of the switch.
Returns:
true if select switch is on; otherwise, false.

Tekla.Structures.TeklaStructuresSettings.IsPourEnabled
Determines whether pour management is enabled.
Returns:
true if pour is enabled; otherwise, false.

Tekla.Structures.TeklaStructuresSettings.GetAdvancedOption(System.String,Tekla.Structures.TeklaStructuresSettings.GetAdvancedOptionTypeEnum,Tekla.Structures.Internal.dotGetAdvancedOption_t@)
Gets the advanced option.
VariableName: Name of the variable.
Type: The type.
AdvancedOption: The advanced option.
Returns: true if ok

Tekla.Structures.TeklaStructuresSettings.GetAdvancedOption(System.String,Tekla.Structures.TeklaStructuresSettings.GetAdvancedOptionTypeEnum,System.Int32,Tekla.Structures.Internal.dotGetAdvancedOption_t@)
Gets the advanced option.
VariableName: Name of the variable.
Type: The type.
ValueStringIteration: The value string iteration.
AdvancedOption: The advanced option.
Returns: true if ok